# Procesamiento Datos zona Gold

In [125]:
#importaciones y configuraciones

from sqlalchemy import create_engine
import pandas as pd

POSTGRES_CONN_STRING = "postgresql://postgres:123456@127.0.0.1:5432/postgres"

version = 1

In [126]:
engine = create_engine(POSTGRES_CONN_STRING)

# Carga de datos

In [127]:
df_employees = pd.read_sql(con=engine,
                           sql='select * from silver.hired_employees')

In [128]:
df_employees.head()

   id            name              datetime  department_id  job_id
0   1     HAROLD VOGT  2021-11-07T02:48:42Z            2.0    96.0
1   2        TY HOFER  2021-05-30T05:43:46Z            8.0     NaN
2   3     LYMAN HADYE  2021-09-01T23:27:38Z            5.0    52.0
3   4   LOTTI CROWTHE  2021-10-01T13:04:21Z           12.0    71.0
4   5  GRETNA LORDING  2021-10-10T22:22:17Z            6.0    80.0

In [129]:
df_departments = pd.read_sql(con=engine,
                             sql='select * from silver.departments')

In [130]:
df_departments.head()

   id                department
0   1        PRODUCT MANAGEMENT
1   2                     SALES
2   3  RESEARCH AND DEVELOPMENT
3   4      BUSINESS DEVELOPMENT
4   5               ENGINEERING

In [131]:
df_departments.dtypes

id             int64
department    object
dtype: object

In [132]:
df_jobs = pd.read_sql(con=engine,
                      sql='select * from silver.jobs')

In [133]:
df_jobs.head()

   id                        job
0   1        MARKETING ASSISTANT
1   2                   VP SALES
2   3         BIOSTATISTICIAN IV
3   4  ACCOUNT REPRESENTATIVE II
4   5               VP MARKETING

# Procesamiento de datos

In [134]:
#ajustamos el nombre de las columnas de id para una mejor comprensi√≥n
df_departments = df_departments.rename(columns={'id':'id_department'})
df_jobs = df_jobs.rename(columns={'id':'id_job'})

In [135]:
# Convertimos las columnas float a int
df_employees['department_id'] = df_employees['department_id'].fillna(0).astype(int)
df_employees['job_id'] = df_employees['job_id'].fillna(0).astype(int)

In [136]:
#unimos employees con departments
df_employees_dj = pd.merge(df_employees,
                           df_departments,
                           how='left',
                           left_on='department_id',
                           right_on='id_department')\
                    .drop(columns=['id_department'])

In [137]:
#unimos el dataframe con los jobs
df_employees_dj = pd.merge(df_employees_dj,
                           df_jobs,
                           how='left',
                           left_on='job_id',
                           right_on='id_job')\
                    .drop(columns=['id_job'])

In [138]:
df_employees_dj['datetime'] = pd.to_datetime(df_employees_dj['datetime'])

In [139]:

df_employees_dj['date'] = df_employees_dj['datetime'].dt.date
df_employees_dj['hour'] = df_employees_dj['datetime'].dt.time
df_employees_dj['year'] = df_employees_dj['datetime'].dt.year
df_employees_dj['quarter'] = df_employees_dj['datetime'].dt.quarter
df_employees_dj['semester'] = df_employees_dj['datetime'].dt.month.apply(lambda x: 1 if x <= 6 else 2)
df_employees_dj['month'] = df_employees_dj['datetime'].dt.month

In [140]:
df_employees_final = df_employees_dj[['date',
                                      'hour',
                                      'year',
                                      'month',
                                      'quarter',
                                      'semester',
                                      'id',
                                      'name',
                                      'department_id',
                                      'department',
                                      'job_id',
                                      'job']]

# Carga de datos

In [141]:
df_employees_final.to_sql(name='hired_employees',
                          schema='gold',
                          con=engine,
                          if_exists='replace',
                          index=False)

999